#ifndef _CMD_CODE_H_
#define _CMD_CODE_H_

/****************************************************************************************************/
/****************************** 心跳指令：确认下发是否正常，下发频率不低于2Hz ******************************/
/****************************************************************************************************/
#define PLUSE_CODE 0x21040001 // 心跳(无指令值)
#define PLUSE_TYPE 0

/****************************************************************************************************/
/******************************************** 状态切换指令 ********************************************/
/****************************************************************************************************/
#define STAND_CODE 0x21010202  // 起立(无指令值)
#define SIT_CODE 0x21010202    // 趴下(无指令值)
#define EMERGE_CODE 0x21020C0E // 软急停(无指令值)
#define INIT_CODE 0x21010C05   // 回零初始化(无指令值)

#define STAND_TYPE 0
#define SIT_TYPE 0
#define EMERGE_TYPE 0
#define INIT_TYPE 0

/****************************************************************************************************/
/************* 轴指令：取值范围[-32767, 32767]，下发频率不低于20Hz,超过250ms未收到指令将停止运动 *************/
/****************************************************************************************************/
// 原地模式：若运动主机超过1s未收到任何轴指令，机器人将恢复正常站立姿态
#define ROLL_CODE 0x21010131    // 调整横滚角：取正值向右翻滚，死区[-12553,12553]
#define PITCH_CODE 0x0x21010130 // 调整俯仰角：取正值低头，死区[-6553,6553]
#define YAW_CODE 0x21010135     // 调整偏航角：取正值时向右旋转，死区[-9553,9553]
#define HEIGHT_CODE 0x21010102  // 调整身体高度：取正值时抬高身体，死区[-20000,20000]

#define ROLL_TYPE 0
#define PITCH_TYPE 0
#define YAW_TYPE 0
#define HEIGHT_TYPE 0

// 移动模式：若轴指令取值在死区内，机器人停止运动
#define YMOVE_CODE 0x21010131 // 指定机器人 y 轴上的期望线速度，正值向右，死区[-12553,12553]
#define XMOVE_CODE 0x21010130 // 指定机器人x轴上的期望线速度，正值向前，死区[-6553,6553]
#define TURN_CODE 0x21010135  // 指定机器人的期望角速度，正值向右转，死区[-9553,9553]

#define YMOVE_TYPE 0
#define XMOVE_TYPE 0
#define TURN_TYPE 0

#endif