#ifndef _CMD_CODE_H_
#define _CMD_CODE_H_

// ！！！！！以下指令不做特别注释的，默认为简单指令

/****************************************************************************************************/
/****************************** 心跳指令：确认下发是否正常，下发频率不低于2Hz ******************************/
/****************************************************************************************************/
#define PLUSE_CODE 0x21040001 // 心跳(无指令值)
#define PLUSE_TYPE 0

/****************************************************************************************************/
/******************************************** 状态切换指令 ********************************************/
/****************************************************************************************************/
#define STAND_SIT_CODE 0x21010202 // 起立/趴下(无指令值)
#define EMERGE_CODE 0x21020C0E    // 软急停(无指令值)
#define INIT_CODE 0x21010C05      // 回零初始化(无指令值)

#define STAND_SIT_TYPE 0
#define EMERGE_TYPE 0
#define INIT_TYPE 0

/****************************************************************************************************/
/************* 轴指令：取值范围[-32767, 32767]，下发频率不低于20Hz,超过250ms未收到指令将停止运动 *************/
/****************************************************************************************************/
// 原地模式：若运动主机超过1s未收到任何轴指令，机器人将恢复正常站立姿态
#define ROLL_CODE 0x21010131    // 调整横滚角：取正值向右翻滚，死区[-12553,12553]
#define PITCH_CODE 0x0x21010130 // 调整俯仰角：取正值低头，死区[-6553,6553]
#define YAW_CODE 0x21010135     // 调整偏航角：取正值时向右旋转，死区[-9553,9553]
#define HEIGHT_CODE 0x21010102  // 调整身体高度：取正值时抬高身体，死区[-20000,20000]

#define ROLL_TYPE 0
#define PITCH_TYPE 0
#define YAW_TYPE 0
#define HEIGHT_TYPE 0

// 移动模式：若轴指令取值在死区内，机器人停止运动
#define YMOVE_CODE 0x21010131 // 指定机器人 y 轴上的期望线速度，正值向右，死区[-12553,12553]
#define XMOVE_CODE 0x21010130 // 指定机器人x轴上的期望线速度，正值向前，死区[-6553,6553]
#define TURN_CODE 0x21010135  // 指定机器人的期望角速度，正值向右转，死区[-9553,9553]

#define YMOVE_TYPE 0
#define XMOVE_TYPE 0
#define TURN_TYPE 0

/****************************************************************************************************/
/****************************************** 运动模式切换指令 *******************************************/
/****************************************************************************************************/
#define LOCAL_MODE_CODE 0x21010D05  // 原地模式(无指令值)
#define MOBILE_MODE_CODE 0x21010D06 // 移动模式(无指令值)

#define LOCAL_MODE_TYPE 0
#define MOBILE_MODE_TYPE 0

/****************************************************************************************************/
/************************************* 步态切换指令：移动模式下使用 **************************************/
/****************************************************************************************************/
#define FLAT_LOW_GAIT_CODE 0x21010300      // 平地低速步态(无指令值)
#define FLAT_MIDDLE_GAIT_CODE 0x21010307   // 平地中速步态(无指令值)
#define FLAT_HIGH_GAIT_CODE 0x21010303     // 平地高速步态(无指令值)
#define CRAWL_NORMAL_GAIT_CODE 0x21010406  // 匍匐/正常步态(无指令值)
#define GRASP_CROSS_GAIT_CODE 0x21010402   // 抓地越障不步态(无指令值)
#define GENERAL_CORSS_GAIT_CODE 0x21010401 // 通用越障步态(无指令值)
#define STEP_CROSS_GAIT_CODE 0x21010407    // 高踏步越障步态(无指令值)

#define FLAT_LOW_GAIT_TYPE 0
#define FLAT_MIDDLE_GAIT_TYPE 0
#define FLAT_HIGH_GAIT_TYPE 0
#define CRAWL_NORMAL_GAIT_TYPE 0
#define GRASP_CROSS_GAIT_TYPE 0
#define GENERAL_CORSS_GAIT_TYPE 0
#define STEP_CROSS_GAIT_TYPE 0

/****************************************************************************************************/
/**************************************** 静止站立下的动作指令 *****************************************/
/****************************************************************************************************/
#define SWAY_BODY_CODE 0x21010204  // 扭身体(无指令值)
#define MOONWALK_CODE 0x2101030C   // 太空步(无指令值)
#define TWIST_JUMP_CODE 0x2101020D // 扭身跳(无指令值)

#define SWAY_BODY_TYPE 0
#define MOONWALK_TYPE 0
#define TWIST_JUMP_TYPE 0

/****************************************************************************************************/
/****************************************** 趴下时的动作指令 *******************************************/
/****************************************************************************************************/
#define TURN_OVER_CODE 0x21010205    // 翻身(无指令值)
#define BACK_FLIP_CODE 0x21010502    // 后空翻(无指令值)
#define GREET_CODE 0x21010507        // 打招呼(无指令值)
#define JUMP_FORWARD_CODE 0x2101050B // 向前跳(无指令值)

#define TURN_OVER_TYPE 0
#define BACK_FLIP_TYPE 0
#define GREET_TYPE 0
#define JUMP_FORWARD_TYPE 0

/****************************************************************************************************/
/****************************************** 控制模式切换指令 *******************************************/
/****************************************************************************************************/
#define AUTOMATIC_MODE_CODE 0x21010C03 // 自主模式：感知主机下发速度指令(无指令值)
#define MANUAL_MODE_CODE 0x21010C02    // 手动模式：手柄或开发主机下发速度指令(无指令值)

#define AUTOMATIC_MODE_TYPE 0
#define MANUAL_MODE_TYPE 0

/****************************************************************************************************/
/******************************************** 保存数据指令 ********************************************/
/****************************************************************************************************/
#define SAVE_DATA_CODE 0x21010C01 // 保存最近100秒内的数据(无指令值)
#define SAVE_DATA_TYPE 0

/****************************************************************************************************/
/******************************************** 持续运动指令 ********************************************/
/****************************************************************************************************/
#define CONTINUOUS_MOTION_CODE 0x21010C06 // 开启后机器人在未收到轴指令时也将保持原地踏步：-1=开启，2=关闭
#define CONTINUOUS_MOTION_TYPE 0

/****************************************************************************************************/
/********************************************** 语音指令 **********************************************/
/****************************************************************************************************/
// 语音指令：手柄app通过语音功能识别用户语音，并下发携带相应指令值的语音指令来控制机器人运动
// 指令值：1=起立，2=坐下，3=前进，4=后退，5=向左平移，6=向右平移，7=停止，8=低头，9-抬头，11=向左看，12=向右看
//        13=向左转90°，14=向右转90°，15=向后转180°，22=打招呼
#define SPEECH_CODE 0x21010C0A
#define SPEECH_TYPE 0

/****************************************************************************************************/
/********************************************* 扬声器指令 *********************************************/
/****************************************************************************************************/
// 扬声器指令
// 指令值：0=关闭，1=开启，2=查询状态（运动主机会上报状态：0=关闭，1=开启）
#define SPEACKER_CODE 0x2101030D
#define SPEACKER_TYPE 0

/****************************************************************************************************/
/******************************************* 感知设置类指令 *******************************************/
/****************************************************************************************************/
// AI功能选项
// 指令值：0x00关闭所有（发送给运动主机），0x20开启停障（发送给运动主机），0xC0开启跟随（发送给运动主机）
//        0x40开启导航避障（发送给感知主机：192.168.1.103:43899）
#define AI_FUNC_CODE 0x21012109
#define AI_FUNC_TYPE 0

/****************************************************************************************************/
/************************ 速度指令(复杂指令)：数据值为双精度浮点型，需在自主模式下发送 ************************/
/****************************************************************************************************/
#define ROTATE_VELOCITY_CODE 0x0141 // 设置旋转角速度：[-1.5, 1.5] (rad/s)
#define XMOVE_VELOCITY_CODE 0x0140  // 设置前后平移速度：[-1.0, 1.0] (m/s)
#define YMOVE_VELOCITY_CODE 0x0145  // 设置左右平移速度：[-0.5, 0.5] (m/s)

#define ROTATE_VELOCITY_TYPE 1
#define XMOVE_VELOCITY_TYPE 1
#define YMOVE_VELOCITY_TYPE 1

/****************************************************************************************************/
/************************************ 机器人状态信息接受指令(复杂指令) ***********************************/
/****************************************************************************************************/
#define ROBOT_STATE_CODE 0x0901 // 机器人状态信息：50Hz
#define ROBOT_STATE_TYPE 1

/****************************************************************************************************/
/************************************ 机器人关节信息接受指令(复杂指令) ***********************************/
/****************************************************************************************************/
#define JOINT_ANGLE_CODE 0x0902    // 关节角度信息：100Hz
#define JOINT_VELOCITY_CODE 0x0903 // 关节速度信息：100Hz

#define JOINT_ANGLE_TYPE 0
#define JOINT_VELOCITY_TYPE 0

#endif